In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df=pd.DataFrame({"column1":[np.random.randint(100) for i in range(5)],"column2":[np.random.randint(100) for i in range(5)],"column3":[np.random.randint(100) for i in range(5)],"column4":[np.random.randint(100) for i in range(5)]})

In [3]:
df

   column1  column2  column3  column4
0       81       93        7       16
1        4       45       85        3
2       75       60       92       85
3        5        2        8       95
4       12       10       22       46

In [4]:
print(df.columns)
print(df.index)

Index(['column1', 'column2', 'column3', 'column4'], dtype='object')
RangeIndex(start=0, stop=5, step=1)

In [5]:
# series concatination
s1=pd.Series(range(6))
s2=s1*s1
s2.index=s2.index+2
df1=pd.concat([s1,s2],axis=1)
df1.columns={"s1","s2"}
df1

    s1    s2
0  0.0   NaN
1  1.0   NaN
2  2.0   0.0
3  3.0   1.0
4  4.0   4.0
5  5.0   9.0
6  NaN  16.0
7  NaN  25.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  5 non-null      int64
 1   column2  5 non-null      int64
 2   column3  5 non-null      int64
 3   column4  5 non-null      int64
dtypes: int64(4)
memory usage: 292.0 bytes

In [7]:
df.head(3)

   column1  column2  column3  column4
0       81       93        7       16
1        4       45       85        3
2       75       60       92       85

In [8]:
df.tail(3)

   column1  column2  column3  column4
2       75       60       92       85
3        5        2        8       95
4       12       10       22       46

In [9]:
df.describe()

        column1    column2    column3    column4
count   5.00000   5.000000   5.000000   5.000000
mean   35.40000  42.000000  42.800000  49.000000
std    39.06789  37.275998  42.210188  40.700123
min     4.00000   2.000000   7.000000   3.000000
25%     5.00000  10.000000   8.000000  16.000000
50%    12.00000  45.000000  22.000000  46.000000
75%    75.00000  60.000000  85.000000  85.000000
max    81.00000  93.000000  92.000000  95.000000

In [10]:
df.T

          0   1   2   3   4
column1  81   4  75   5  12
column2  93  45  60   2  10
column3   7  85  92   8  22
column4  16   3  85  95  46

In [11]:
print(df.axes)
x,y=df.axes
print(x)
print(y)

[RangeIndex(start=0, stop=5, step=1), Index(['column1', 'column2', 'column3', 'column4'], dtype='object')]
RangeIndex(start=0, stop=5, step=1)
Index(['column1', 'column2', 'column3', 'column4'], dtype='object')

In [12]:
df.dtypes

column1    int64
column2    int64
column3    int64
column4    int64
dtype: object

In [13]:
df.empty

False

In [14]:
print(df.ndim)

2

In [15]:
df.shape

(5, 4)

In [16]:
df.size

20

In [17]:
df.values

array([[81, 93,  7, 16],
       [ 4, 45, 85,  3],
       [75, 60, 92, 85],
       [ 5,  2,  8, 95],
       [12, 10, 22, 46]], dtype=int64)

In [18]:
df.rank()

   column1  column2  column3  column4
0      5.0      5.0      1.0      2.0
1      1.0      3.0      4.0      1.0
2      4.0      4.0      5.0      4.0
3      2.0      1.0      2.0      5.0
4      3.0      2.0      3.0      3.0

In [19]:
df.sort_values("column1",ascending=True)

   column1  column2  column3  column4
1        4       45       85        3
3        5        2        8       95
4       12       10       22       46
2       75       60       92       85
0       81       93        7       16

In [20]:
df.sort_index(ascending=False)

   column1  column2  column3  column4
4       12       10       22       46
3        5        2        8       95
2       75       60       92       85
1        4       45       85        3
0       81       93        7       16

In [21]:
df.astype(object).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  5 non-null      object
 1   column2  5 non-null      object
 2   column3  5 non-null      object
 3   column4  5 non-null      object
dtypes: object(4)
memory usage: 292.0+ bytes

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  5 non-null      int64
 1   column2  5 non-null      int64
 2   column3  5 non-null      int64
 3   column4  5 non-null      int64
dtypes: int64(4)
memory usage: 292.0 bytes

In [23]:
for column,series in df.items():
    print(column)
    print(series)

column1
0    81
1     4
2    75
3     5
4    12
Name: column1, dtype: int64
column2
0    93
1    45
2    60
3     2
4    10
Name: column2, dtype: int64
column3
0     7
1    85
2    92
3     8
4    22
Name: column3, dtype: int64
column4
0    16
1     3
2    85
3    95
4    46
Name: column4, dtype: int64

In [24]:
for row_index,row in df.iterrows():
    print(row_index)
    print(row)

0
column1    81
column2    93
column3     7
column4    16
Name: 0, dtype: int64
1
column1     4
column2    45
column3    85
column4     3
Name: 1, dtype: int64
2
column1    75
column2    60
column3    92
column4    85
Name: 2, dtype: int64
3
column1     5
column2     2
column3     8
column4    95
Name: 3, dtype: int64
4
column1    12
column2    10
column3    22
column4    46
Name: 4, dtype: int64

In [25]:
df.abs()

   column1  column2  column3  column4
0       81       93        7       16
1        4       45       85        3
2       75       60       92       85
3        5        2        8       95
4       12       10       22       46

In [26]:
df.add(50)

   column1  column2  column3  column4
0      131      143       57       66
1       54       95      135       53
2      125      110      142      135
3       55       52       58      145
4       62       60       72       96

In [27]:
df["column1"].count()

5

In [28]:
df.count()

column1    5
column2    5
column3    5
column4    5
dtype: int64

In [29]:
df.cummax()

   column1  column2  column3  column4
0       81       93        7       16
1       81       93       85       16
2       81       93       92       85
3       81       93       92       95
4       81       93       92       95

In [30]:
df.cummin()

   column1  column2  column3  column4
0       81       93        7       16
1        4       45        7        3
2        4       45        7        3
3        4        2        7        3
4        4        2        7        3

In [31]:
df.diff()

   column1  column2  column3  column4
0      NaN      NaN      NaN      NaN
1    -77.0    -48.0     78.0    -13.0
2     71.0     15.0      7.0     82.0
3    -70.0    -58.0    -84.0     10.0
4      7.0      8.0     14.0    -49.0

In [32]:
df.min()

column1    4
column2    2
column3    7
column4    3
dtype: int64

In [33]:
df.max()

column1    81
column2    93
column3    92
column4    95
dtype: int64

In [34]:
df.mean()

column1    35.4
column2    42.0
column3    42.8
column4    49.0
dtype: float64

In [35]:
df.median()

column1    12.0
column2    45.0
column3    22.0
column4    46.0
dtype: float64

In [36]:
df1=df.where(df>50)

In [37]:
df1

   column1  column2  column3  column4
0     81.0     93.0      NaN      NaN
1      NaN      NaN     85.0      NaN
2     75.0     60.0     92.0     85.0
3      NaN      NaN      NaN     95.0
4      NaN      NaN      NaN      NaN

In [38]:
print(df.filter(items=["column1","column2"]))
print(df.filter(items=[3],axis=0))

   column1  column2
0       81       93
1        4       45
2       75       60
3        5        2
4       12       10
   column1  column2  column3  column4
3        5        2        8       95

In [39]:
df.columns.values

array(['column1', 'column2', 'column3', 'column4'], dtype=object)

In [40]:
df.columns

Index(['column1', 'column2', 'column3', 'column4'], dtype='object')

In [41]:
df.columns={"col1","col2","col3","col4"}

In [42]:
df["col1"]

0    93
1    45
2    60
3     2
4    10
Name: col1, dtype: int64

In [43]:
df[["col1","col2"]]

   col1  col2
0    93    16
1    45     3
2    60    85
3     2    95
4    10    46

In [44]:
df[df.columns[[i for i in range(4) if i%2==0]]]

   col3  col4
0    81     7
1     4    85
2    75    92
3     5     8
4    12    22

In [45]:
df=df[["col1","col2","col3","col4"]]

In [46]:
df1=df

In [47]:
df1.pop("col1")

0    93
1    45
2    60
3     2
4    10
Name: col1, dtype: int64

In [48]:
df1

   col2  col3  col4
0    16    81     7
1     3     4    85
2    85    75    92
3    95     5     8
4    46    12    22

In [49]:
df1["col1"]=[96,85,19,0,58]

In [50]:
df1

   col2  col3  col4  col1
0    16    81     7    96
1     3     4    85    85
2    85    75    92    19
3    95     5     8     0
4    46    12    22    58

In [51]:
df1["new_col"]=range(len(df1))
df1

   col2  col3  col4  col1  new_col
0    16    81     7    96        0
1     3     4    85    85        1
2    85    75    92    19        2
3    95     5     8     0        3
4    46    12    22    58        4

In [52]:
df1["new2"]=np.nan

In [53]:
df1

   col2  col3  col4  col1  new_col  new2
0    16    81     7    96        0   NaN
1     3     4    85    85        1   NaN
2    85    75    92    19        2   NaN
3    95     5     8     0        3   NaN
4    46    12    22    58        4   NaN

In [54]:
df

   col2  col3  col4  col1  new_col  new2
0    16    81     7    96        0   NaN
1     3     4    85    85        1   NaN
2    85    75    92    19        2   NaN
3    95     5     8     0        3   NaN
4    46    12    22    58        4   NaN

In [55]:
df[["col2","col1"]]=df[["col1","col2"]]
df

   col2  col3  col4  col1  new_col  new2
0    96    81     7    16        0   NaN
1    85     4    85     3        1   NaN
2    19    75    92    85        2   NaN
3     0     5     8    95        3   NaN
4    58    12    22    46        4   NaN

In [56]:
df.drop("new2",axis=1,inplace=True)

In [57]:
df

   col2  col3  col4  col1  new_col
0    96    81     7    16        0
1    85     4    85     3        1
2    19    75    92    85        2
3     0     5     8    95        3
4    58    12    22    46        4

In [58]:
df[df.columns[4]]=df.sum(axis=1)

In [59]:
df.sum(axis=1)

0    400
1    355
2    544
3    219
4    280
dtype: int64

In [60]:
np.log(df["new_col"])

0    5.298317
1    5.181784
2    5.609472
3    4.709530
4    4.955827
Name: new_col, dtype: float64

In [61]:
df

   col2  col3  col4  col1  new_col
0    96    81     7    16      200
1    85     4    85     3      178
2    19    75    92    85      273
3     0     5     8    95      111
4    58    12    22    46      142

In [62]:
df.new_col=df.col2.where(df.new_col>200 , other=df.col1)

In [63]:
df

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
2    19    75    92    85       19
3     0     5     8    95       95
4    58    12    22    46       46

In [64]:
df.col1.size

5

In [65]:
df.col1.count()

5

In [66]:
df.col1.idxmin()

1

In [67]:
df.loc[:,'col2':"col4"]

   col2  col3  col4
0    96    81     7
1    85     4    85
2    19    75    92
3     0     5     8
4    58    12    22

In [68]:
df.iloc[:,0:2]

   col2  col3
0    96    81
1    85     4
2    19    75
3     0     5
4    58    12

In [69]:
df.columns.get_loc("col1")

3

In [70]:
df.columns.is_monotonic_decreasing

False

In [71]:
if df.columns.is_unique:
    pass

In [72]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [73]:
df.index[1]

1

In [74]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [75]:
df.index.values

array([0, 1, 2, 3, 4], dtype=int64)

In [76]:
df

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
2    19    75    92    85       19
3     0     5     8    95       95
4    58    12    22    46       46

In [77]:
df1=pd.DataFrame({"col2":[56],"col3":[65],"col4":[82],"col1":[28],"new_col":[30]})
df=pd.concat([df,df1],ignore_index=True)
df

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
2    19    75    92    85       19
3     0     5     8    95       95
4    58    12    22    46       46
5    56    65    82    28       30

In [78]:
df.drop(4,inplace=True)

In [79]:
df.index=range(len(df))

In [80]:
df

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
2    19    75    92    85       19
3     0     5     8    95       95
4    56    65    82    28       30

In [81]:
df[df.col2>50]

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
4    56    65    82    28       30

In [82]:
df[df.col2.isin([85,56])]

   col2  col3  col4  col1  new_col
1    85     4    85     3        3
4    56    65    82    28       30

In [83]:
df.sort_values(df.columns[0],ascending=False)

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
4    56    65    82    28       30
2    19    75    92    85       19
3     0     5     8    95       95

In [84]:
df=pd.concat([df,df1],ignore_index=True)

In [85]:
df

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
2    19    75    92    85       19
3     0     5     8    95       95
4    56    65    82    28       30
5    56    65    82    28       30

In [86]:
df.drop_duplicates(inplace=True)

In [87]:
df

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     3        3
2    19    75    92    85       19
3     0     5     8    95       95
4    56    65    82    28       30

In [88]:
df.at[1,"col1"]=5
df

   col2  col3  col4  col1  new_col
0    96    81     7    16       16
1    85     4    85     5        3
2    19    75    92    85       19
3     0     5     8    95       95
4    56    65    82    28       30

In [89]:
df.iat[1,1]

4

In [101]:
df1=pd.DataFrame({"col1":[1,2,3],"col2":[4,5,6],"col3":[7,8,9]})
df2=pd.DataFrame({"col1":[11,12,13],"col4":[14,15,16],"col5":[17,18,19]})

In [102]:
df1

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [103]:
df2

   col1  col4  col5
0    11    14    17
1    12    15    18
2    13    16    19

In [112]:
df3=pd.merge(left=df1,right=df2,how='outer',left_on="col1",right_on="col1")

In [113]:
df3

   col1  col2  col3  col4  col5
0     1   4.0   7.0   NaN   NaN
1     2   5.0   8.0   NaN   NaN
2     3   6.0   9.0   NaN   NaN
3    11   NaN   NaN  14.0  17.0
4    12   NaN   NaN  15.0  18.0
5    13   NaN   NaN  16.0  19.0

In [117]:
df=pd.read_csv("C:\\Users\\saran\\OneDrive\\Desktop\\practice\\titanic\\train.csv")

In [121]:
df1=df.groupby("Sex")

In [129]:
print(df1.groups)

{'female': [1, 2, 3, 8, 9, 10, 11, 14, 15, 18, 19, 22, 24, 25, 28, 31, 32, 38, 39, 40, 41, 43, 44, 47, 49, 52, 53, 56, 58, 61, 66, 68, 71, 79, 82, 84, 85, 88, 98, 100, 106, 109, 111, 113, 114, 119, 123, 128, 132, 133, 136, 140, 141, 142, 147, 151, 156, 161, 166, 167, 172, 177, 180, 184, 186, 190, 192, 194, 195, 198, 199, 205, 208, 211, 215, 216, 218, 229, 230, 233, 235, 237, 240, 241, 246, 247, 251, 254, 255, 256, 257, 258, 259, 264, 268, 269, 272, 274, 275, 276, ...], 'male': [0, 4, 5, 6, 7, 12, 13, 16, 17, 20, 21, 23, 26, 27, 29, 30, 33, 34, 35, 36, 37, 42, 45, 46, 48, 50, 51, 54, 55, 57, 59, 60, 62, 63, 64, 65, 67, 69, 70, 72, 73, 74, 75, 76, 77, 78, 80, 81, 83, 86, 87, 89, 90, 91, 92, 93, 94, 95, 96, 97, 99, 101, 102, 103, 104, 105, 107, 108, 110, 112, 115, 116, 117, 118, 120, 121, 122, 124, 125, 126, 127, 129, 130, 131, 134, 135, 137, 138, 139, 143, 144, 145, 146, 148, 149, 150, 152, 153, 154, 155, ...]}

In [132]:
for name,group in df1:
    print(type(name),type(group))

<class 'str'> <class 'pandas.core.frame.DataFrame'>
<class 'str'> <class 'pandas.core.frame.DataFrame'>

In [137]:
df1.get_group("male")["Pclass"].sum()

1379

In [146]:
df1.get_group("male").agg({"PassengerId":np.sum,"Survived":np.max})

PassengerId    262043
Survived            1
dtype: int64